Duplicate values

In [6]:
import pandas as pd

In [7]:
data = pd.read_csv('E:\\Download\\df.csv')
data

    EEID     NAME GENDER   SALARY
0  EMPO1     JIYA      F      NaN
1  EMPO2    MEERA      F  20000.0
2  EMPO3     MEET    NaN  21000.0
3  EMPO1   SHIVAM      M  22000.0
4  EMPO5      NaN      F  23000.0
5  EMPO6  PRATHAM      M      NaN

In [8]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
dtype: bool

In [9]:
data["EEID"].duplicated()

0    False
1    False
2    False
3     True
4    False
5    False
Name: EEID, dtype: bool

In [10]:
data["EEID"].duplicated().sum()

np.int64(1)

In [11]:
data.drop_duplicates()

    EEID     NAME GENDER   SALARY
0  EMPO1     JIYA      F      NaN
1  EMPO2    MEERA      F  20000.0
2  EMPO3     MEET    NaN  21000.0
3  EMPO1   SHIVAM      M  22000.0
4  EMPO5      NaN      F  23000.0
5  EMPO6  PRATHAM      M      NaN

In [13]:
data.drop_duplicates("SALARY")

    EEID    NAME GENDER   SALARY
0  EMPO1    JIYA      F      NaN
1  EMPO2   MEERA      F  20000.0
2  EMPO3    MEET    NaN  21000.0
3  EMPO1  SHIVAM      M  22000.0
4  EMPO5     NaN      F  23000.0